RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_romdriver_e907.c
/**
  ******************************************************************************
  * @file    bl808_romdriver_e907.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2021 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl808_romdriver_e907.h"
#include <string.h>

/** @addtogroup  BL808_Periph_Driver
 *  @{
 */

/** @defgroup ROMDRIVER
 *  @brief ROMDRIVER common functions
 *  @{
 */

/** @defgroup ROMDRIVER_Private_Type
 *  @{
 */

/*@} end of group ROMDRIVER_Private_Type*/

/** @defgroup ROMDRIVER_Private_Defines
 *  @{
 */

/*@} end of group ROMDRIVER_Private_Defines */

/** @defgroup ROMDRIVER_Private_Variables
 *  @{
 */

/*@} end of group ROMDRIVER_Private_Variables */

/** @defgroup ROMDRIVER_Global_Variables
 *  @{
 */


uint32_t const romDriverTable[]={
    0x08080001,
    0x00000000,
    0x00000000,
    0x00000000,


    [ROM_API_INDEX_AON_LowPower_Enter_PDS0]                = (uint32_t)AON_LowPower_Enter_PDS0,
    [ROM_API_INDEX_AON_LowPower_Exit_PDS0]                 = (uint32_t)AON_LowPower_Exit_PDS0,
    [ROM_API_INDEX_AON_Power_Off_BG]                       = (uint32_t)AON_Power_Off_BG,
    [ROM_API_INDEX_AON_Power_Off_LDO15_RF]                 = (uint32_t)AON_Power_Off_LDO15_RF,
    [ROM_API_INDEX_AON_Power_Off_MBG]                      = (uint32_t)AON_Power_Off_MBG,
    [ROM_API_INDEX_AON_Power_Off_SFReg]                    = (uint32_t)AON_Power_Off_SFReg,
    [ROM_API_INDEX_AON_Power_Off_XTAL]                     = (uint32_t)AON_Power_Off_XTAL,
    [ROM_API_INDEX_AON_Power_On_BG]                        = (uint32_t)AON_Power_On_BG,
    [ROM_API_INDEX_AON_Power_On_LDO15_RF]                  = (uint32_t)AON_Power_On_LDO15_RF,
    [ROM_API_INDEX_AON_Power_On_MBG]                       = (uint32_t)AON_Power_On_MBG,
    [ROM_API_INDEX_AON_Power_On_SFReg]                     = (uint32_t)AON_Power_On_SFReg,
    [ROM_API_INDEX_AON_Power_On_XTAL]                      = (uint32_t)AON_Power_On_XTAL,
    [ROM_API_INDEX_AON_Set_DCDC11_Top_Vout]                = (uint32_t)AON_Set_DCDC11_Top_Vout,
    [ROM_API_INDEX_AON_Set_Xtal_CapCode]                   = (uint32_t)AON_Set_Xtal_CapCode,
    [ROM_API_INDEX_AON_Trim_DCDC11_Vout]                   = (uint32_t)AON_Trim_DCDC11_Vout,
    [ROM_API_INDEX_AON_Trim_DCDC18_Vout]                   = (uint32_t)AON_Trim_DCDC18_Vout,
    [ROM_API_INDEX_AON_Trim_USB20_RCAL]                    = (uint32_t)AON_Trim_USB20_RCAL,
    [ROM_API_INDEX_AON_Get_Xtal_CapCode]                   = (uint32_t)AON_Get_Xtal_CapCode,

    [ROM_API_INDEX_ASM_Delay_Us]                           = (uint32_t)ASM_Delay_Us,

    [ROM_API_INDEX_arch_delay_ms]                          = (uint32_t)arch_delay_ms,
    [ROM_API_INDEX_arch_delay_us]                          = (uint32_t)arch_delay_us,

    [ROM_API_INDEX_EF_Ctrl_Crc_Result]                     = (uint32_t)EF_Ctrl_Crc_Result,
    [ROM_API_INDEX_EF_Ctrl_Get_Customer_PIDVID]            = (uint32_t)EF_Ctrl_Get_Customer_PIDVID,
    [ROM_API_INDEX_EF_Ctrl_Read_Chip_ID]                   = (uint32_t)EF_Ctrl_Read_Chip_ID,
    [ROM_API_INDEX_EF_Ctrl_Read_MAC_Address]               = (uint32_t)EF_Ctrl_Read_MAC_Address,
    [ROM_API_INDEX_EF_Ctrl_Read_MAC_Address_Raw]           = (uint32_t)EF_Ctrl_Read_MAC_Address_Raw,
    [ROM_API_INDEX_EF_Ctrl_AutoLoad_Done]                  = (uint32_t)EF_Ctrl_AutoLoad_Done,
    [ROM_API_INDEX_EF_Ctrl_Busy]                           = (uint32_t)EF_Ctrl_Busy,
    [ROM_API_INDEX_EF_Ctrl_Crc_Is_Busy]                    = (uint32_t)EF_Ctrl_Crc_Is_Busy,
    [ROM_API_INDEX_EF_Ctrl_Get_Trim_Parity]                = (uint32_t)EF_Ctrl_Get_Trim_Parity,
    [ROM_API_INDEX_EF_Ctrl_Is_All_Bits_Zero]               = (uint32_t)EF_Ctrl_Is_All_Bits_Zero,
    [ROM_API_INDEX_EF_Ctrl_Clear]                          = (uint32_t)EF_Ctrl_Clear,
    [ROM_API_INDEX_EF_Ctrl_Crc_Enable]                     = (uint32_t)EF_Ctrl_Crc_Enable,
    [ROM_API_INDEX_EF_Ctrl_Crc_Set_Golden]                 = (uint32_t)EF_Ctrl_Crc_Set_Golden,
    [ROM_API_INDEX_EF_Ctrl_Load_Efuse_R0]                  = (uint32_t)EF_Ctrl_Load_Efuse_R0,
    [ROM_API_INDEX_EF_Ctrl_Load_Efuse_R1]                  = (uint32_t)EF_Ctrl_Load_Efuse_R1,
    [ROM_API_INDEX_EF_Ctrl_Program_Direct]                 = (uint32_t)EF_Ctrl_Program_Direct,
    [ROM_API_INDEX_EF_Ctrl_Program_Direct_R0]              = (uint32_t)EF_Ctrl_Program_Direct_R0,
    [ROM_API_INDEX_EF_Ctrl_Program_Direct_R1]              = (uint32_t)EF_Ctrl_Program_Direct_R1,
    [ROM_API_INDEX_EF_Ctrl_Program_Efuse_0]                = (uint32_t)EF_Ctrl_Program_Efuse_0,
    [ROM_API_INDEX_EF_Ctrl_Program_Efuse_1]                = (uint32_t)EF_Ctrl_Program_Efuse_1,
    [ROM_API_INDEX_EF_Ctrl_Read_ADC_Gain_Trim]             = (uint32_t)EF_Ctrl_Read_ADC_Gain_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_AES_Key]                   = (uint32_t)EF_Ctrl_Read_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Read_DCDC11_Trim]               = (uint32_t)EF_Ctrl_Read_DCDC11_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_DCDC18_Trim]               = (uint32_t)EF_Ctrl_Read_DCDC18_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_Dbg_Pwd]                   = (uint32_t)EF_Ctrl_Read_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Read_Device_Info]               = (uint32_t)EF_Ctrl_Read_Device_Info,
    [ROM_API_INDEX_EF_Ctrl_Read_Direct]                    = (uint32_t)EF_Ctrl_Read_Direct,
    [ROM_API_INDEX_EF_Ctrl_Read_Direct_R0]                 = (uint32_t)EF_Ctrl_Read_Direct_R0,
    [ROM_API_INDEX_EF_Ctrl_Read_Direct_R1]                 = (uint32_t)EF_Ctrl_Read_Direct_R1,
    [ROM_API_INDEX_EF_Ctrl_Read_LDO18FLASH_Trim]           = (uint32_t)EF_Ctrl_Read_LDO18FLASH_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_LDO18IO_Vout_Trim]         = (uint32_t)EF_Ctrl_Read_LDO18IO_Vout_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_RC32K_Trim]                = (uint32_t)EF_Ctrl_Read_RC32K_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_RC32M_Trim]                = (uint32_t)EF_Ctrl_Read_RC32M_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_Secure_Boot]               = (uint32_t)EF_Ctrl_Read_Secure_Boot,
    [ROM_API_INDEX_EF_Ctrl_Read_Secure_Cfg]                = (uint32_t)EF_Ctrl_Read_Secure_Cfg,
    [ROM_API_INDEX_EF_Ctrl_Read_Sw_Usage]                  = (uint32_t)EF_Ctrl_Read_Sw_Usage,
    [ROM_API_INDEX_EF_Ctrl_Read_TSEN_Trim]                 = (uint32_t)EF_Ctrl_Read_TSEN_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_USB20RCAL_Trim]            = (uint32_t)EF_Ctrl_Read_USB20RCAL_Trim,
    [ROM_API_INDEX_EF_Ctrl_Read_Xtal_Trim_RC32M]           = (uint32_t)EF_Ctrl_Read_Xtal_Trim_RC32M,
    [ROM_API_INDEX_EF_Ctrl_Readlock_AES_Key]               = (uint32_t)EF_Ctrl_Readlock_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Readlock_Dbg_Pwd]               = (uint32_t)EF_Ctrl_Readlock_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Set_sf_key_re_sel]              = (uint32_t)EF_Ctrl_Set_sf_key_re_sel,
    [ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_0]                   = (uint32_t)EF_Ctrl_Sw_AHB_Clk_0,
    [ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_1]                   = (uint32_t)EF_Ctrl_Sw_AHB_Clk_1,
    [ROM_API_INDEX_EF_Ctrl_Write_AES_Key]                  = (uint32_t)EF_Ctrl_Write_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Write_Dbg_Pwd]                  = (uint32_t)EF_Ctrl_Write_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Write_MAC_Address]              = (uint32_t)EF_Ctrl_Write_MAC_Address,
    [ROM_API_INDEX_EF_Ctrl_Write_Secure_Boot]              = (uint32_t)EF_Ctrl_Write_Secure_Boot,
    [ROM_API_INDEX_EF_Ctrl_Write_Secure_Cfg]               = (uint32_t)EF_Ctrl_Write_Secure_Cfg,
    [ROM_API_INDEX_EF_Ctrl_Write_Sw_Usage]                 = (uint32_t)EF_Ctrl_Write_Sw_Usage,
    [ROM_API_INDEX_EF_Ctrl_Writelock_AES_Key]              = (uint32_t)EF_Ctrl_Writelock_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Writelock_Dbg_Pwd]              = (uint32_t)EF_Ctrl_Writelock_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Writelock_MAC_Address]          = (uint32_t)EF_Ctrl_Writelock_MAC_Address,
    [ROM_API_INDEX_EF_Ctrl_Writelock_Sw_Usage]             = (uint32_t)EF_Ctrl_Writelock_Sw_Usage,

