RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_romdriver_e907.c
    [ROM_API_INDEX_HBN_32K_Sel]                            = (uint32_t)HBN_32K_Sel,
    [ROM_API_INDEX_HBN_Aon_Pad_Cfg]                        = (uint32_t)HBN_Aon_Pad_Cfg,
    [ROM_API_INDEX_HBN_Aon_Pad_Ctrl]                       = (uint32_t)HBN_Aon_Pad_Ctrl,
    [ROM_API_INDEX_HBN_Aon_Pad_WakeUpCfg]                  = (uint32_t)HBN_Aon_Pad_WakeUpCfg,
    [ROM_API_INDEX_HBN_Clear_IRQ]                          = (uint32_t)HBN_Clear_IRQ,
    [ROM_API_INDEX_HBN_Clear_RTC_Counter]                  = (uint32_t)HBN_Clear_RTC_Counter,
    [ROM_API_INDEX_HBN_Clear_RTC_INT]                      = (uint32_t)HBN_Clear_RTC_INT,
    [ROM_API_INDEX_HBN_Disable_AComp0_IRQ]                 = (uint32_t)HBN_Disable_AComp0_IRQ,
    [ROM_API_INDEX_HBN_Disable_AComp1_IRQ]                 = (uint32_t)HBN_Disable_AComp1_IRQ,
    [ROM_API_INDEX_HBN_Disable_BOD_IRQ]                    = (uint32_t)HBN_Disable_BOD_IRQ,
    [ROM_API_INDEX_HBN_Enable_AComp0_IRQ]                  = (uint32_t)HBN_Enable_AComp0_IRQ,
    [ROM_API_INDEX_HBN_Enable_AComp1_IRQ]                  = (uint32_t)HBN_Enable_AComp1_IRQ,
    [ROM_API_INDEX_HBN_Enable_BOD_IRQ]                     = (uint32_t)HBN_Enable_BOD_IRQ,
    [ROM_API_INDEX_HBN_Enable_RTC_Counter]                 = (uint32_t)HBN_Enable_RTC_Counter,
    [ROM_API_INDEX_HBN_GPIO_INT_Disable]                   = (uint32_t)HBN_GPIO_INT_Disable,
    [ROM_API_INDEX_HBN_GPIO_INT_Enable]                    = (uint32_t)HBN_GPIO_INT_Enable,
    [ROM_API_INDEX_HBN_Get_RTC_Misc_Cfg]                   = (uint32_t)HBN_Get_RTC_Misc_Cfg,
    [ROM_API_INDEX_HBN_Get_RTC_Timer_Val]                  = (uint32_t)HBN_Get_RTC_Timer_Val,
    [ROM_API_INDEX_HBN_Get_Xtal_Type]                      = (uint32_t)HBN_Get_Xtal_Type,
    [ROM_API_INDEX_HBN_Hw_Pu_Pd_Cfg]                       = (uint32_t)HBN_Hw_Pu_Pd_Cfg,
    [ROM_API_INDEX_HBN_PD_RC32K_All_State]                 = (uint32_t)HBN_PD_RC32K_All_State,
    [ROM_API_INDEX_HBN_PD_RC32K_In_Poff]                   = (uint32_t)HBN_PD_RC32K_In_Poff,
    [ROM_API_INDEX_HBN_PIR_Disable]                        = (uint32_t)HBN_PIR_Disable,
    [ROM_API_INDEX_HBN_PIR_Enable]                         = (uint32_t)HBN_PIR_Enable,
    [ROM_API_INDEX_HBN_PIR_HPF_Sel]                        = (uint32_t)HBN_PIR_HPF_Sel,
    [ROM_API_INDEX_HBN_PIR_INT_Config]                     = (uint32_t)HBN_PIR_INT_Config,
    [ROM_API_INDEX_HBN_PIR_LPF_Sel]                        = (uint32_t)HBN_PIR_LPF_Sel,
    [ROM_API_INDEX_HBN_Pin_WakeUp_Mask]                    = (uint32_t)HBN_Pin_WakeUp_Mask,
    [ROM_API_INDEX_HBN_Power_Off_RC32K]                    = (uint32_t)HBN_Power_Off_RC32K,
    [ROM_API_INDEX_HBN_Power_Off_Xtal_32K]                 = (uint32_t)HBN_Power_Off_Xtal_32K,
    [ROM_API_INDEX_HBN_Power_On_RC32K]                     = (uint32_t)HBN_Power_On_RC32K,
    [ROM_API_INDEX_HBN_Power_On_Xtal_32K]                  = (uint32_t)HBN_Power_On_Xtal_32K,
    [ROM_API_INDEX_HBN_Reset]                              = (uint32_t)HBN_Reset,
    [ROM_API_INDEX_HBN_Set_BOD_Cfg]                        = (uint32_t)HBN_Set_BOD_Cfg,
    [ROM_API_INDEX_HBN_Set_BOD_Config]                     = (uint32_t)HBN_Set_BOD_Config,
    [ROM_API_INDEX_HBN_Set_Core_Reboot_Config]             = (uint32_t)HBN_Set_Core_Reboot_Config,
    [ROM_API_INDEX_HBN_Set_HRAM_Ret]                       = (uint32_t)HBN_Set_HRAM_Ret,
    [ROM_API_INDEX_HBN_Set_HRAM_slp]                       = (uint32_t)HBN_Set_HRAM_slp,
    [ROM_API_INDEX_HBN_Set_Hand_Off_Config]                = (uint32_t)HBN_Set_Hand_Off_Config,
    [ROM_API_INDEX_HBN_Set_IO4041_As_Xtal_32K_IO]          = (uint32_t)HBN_Set_IO4041_As_Xtal_32K_IO,
    [ROM_API_INDEX_HBN_Set_Ldo11_All_Vout]                 = (uint32_t)HBN_Set_Ldo11_All_Vout,
    [ROM_API_INDEX_HBN_Set_Ldo11_Aon_Vout]                 = (uint32_t)HBN_Set_Ldo11_Aon_Vout,
    [ROM_API_INDEX_HBN_Set_Ldo11_Rt_Vout]                  = (uint32_t)HBN_Set_Ldo11_Rt_Vout,
    [ROM_API_INDEX_HBN_Set_Ldo11_Rtc_Vout]                 = (uint32_t)HBN_Set_Ldo11_Rtc_Vout,
    [ROM_API_INDEX_HBN_Set_Ldo18flash_Repower_Delay]       = (uint32_t)HBN_Set_Ldo18flash_Repower_Delay,
    [ROM_API_INDEX_HBN_Set_MCU_Root_CLK_Sel]               = (uint32_t)HBN_Set_MCU_Root_CLK_Sel,
    [ROM_API_INDEX_HBN_Set_MCU_XCLK_Sel]                   = (uint32_t)HBN_Set_MCU_XCLK_Sel,
    [ROM_API_INDEX_HBN_Set_MM_Power_Config]                = (uint32_t)HBN_Set_MM_Power_Config,
    [ROM_API_INDEX_HBN_Set_PIR_Interval]                   = (uint32_t)HBN_Set_PIR_Interval,
    [ROM_API_INDEX_HBN_Set_PIR_Threshold]                  = (uint32_t)HBN_Set_PIR_Threshold,
    [ROM_API_INDEX_HBN_Set_RTC_Misc_Cfg]                   = (uint32_t)HBN_Set_RTC_Misc_Cfg,
    [ROM_API_INDEX_HBN_Set_RTC_Timer]                      = (uint32_t)HBN_Set_RTC_Timer,
    [ROM_API_INDEX_HBN_Set_Status_Flag]                    = (uint32_t)HBN_Set_Status_Flag,
    [ROM_API_INDEX_HBN_Set_UART_CLK_Sel]                   = (uint32_t)HBN_Set_UART_CLK_Sel,
    [ROM_API_INDEX_HBN_Set_Wakeup_Addr]                    = (uint32_t)HBN_Set_Wakeup_Addr,
    [ROM_API_INDEX_HBN_Set_Xtal_Type]                      = (uint32_t)HBN_Set_Xtal_Type,
    [ROM_API_INDEX_HBN_Trim_RC32K]                         = (uint32_t)HBN_Trim_RC32K,
    [ROM_API_INDEX_HBN_Get_BOD_OUT_State]                  = (uint32_t)HBN_Get_BOD_OUT_State,
    [ROM_API_INDEX_HBN_Get_INT_State]                      = (uint32_t)HBN_Get_INT_State,
    [ROM_API_INDEX_HBN_Get_MCU_Root_CLK_Sel]               = (uint32_t)HBN_Get_MCU_Root_CLK_Sel,
    [ROM_API_INDEX_HBN_Get_MCU_XCLK_Sel]                   = (uint32_t)HBN_Get_MCU_XCLK_Sel,
    [ROM_API_INDEX_HBN_Get_Ldo18flash_Repower_Config]      = (uint32_t)HBN_Get_Ldo18flash_Repower_Config,
    [ROM_API_INDEX_HBN_Get_PIR_Interval]                   = (uint32_t)HBN_Get_PIR_Interval,
    [ROM_API_INDEX_HBN_Get_PIR_Threshold]                  = (uint32_t)HBN_Get_PIR_Threshold,
    [ROM_API_INDEX_HBN_Get_Status_Flag]                    = (uint32_t)HBN_Get_Status_Flag,
    [ROM_API_INDEX_HBN_Get_Wakeup_Addr]                    = (uint32_t)HBN_Get_Wakeup_Addr,
    [ROM_API_INDEX_HBN_Get_Core_Unhalt_Config]             = (uint32_t)HBN_Get_Core_Unhalt_Config,
    [ROM_API_INDEX_HBN_Get_Hand_Off_Config]                = (uint32_t)HBN_Get_Hand_Off_Config,
    [ROM_API_INDEX_HBN_Get_MM_Power_Config]                = (uint32_t)HBN_Get_MM_Power_Config,
    [ROM_API_INDEX_HBN_Get_Pin_Wakeup_Mode]                = (uint32_t)HBN_Get_Pin_Wakeup_Mode,
    [ROM_API_INDEX_HBN_Enable]                             = (uint32_t)HBN_Enable,
    [ROM_API_INDEX_HBN_Mode_Enter]                         = (uint32_t)HBN_Mode_Enter,
    [ROM_API_INDEX_HBN_Power_Down_Flash]                   = (uint32_t)HBN_Power_Down_Flash,

    [ROM_API_INDEX_L1C_DCache_Clean_All]                   = (uint32_t)L1C_DCache_Clean_All,
    [ROM_API_INDEX_L1C_DCache_Clean_By_Addr]               = (uint32_t)L1C_DCache_Clean_By_Addr,
    [ROM_API_INDEX_L1C_DCache_Clean_Invalid_All]           = (uint32_t)L1C_DCache_Clean_Invalid_All,
    [ROM_API_INDEX_L1C_DCache_Clean_Invalid_By_Addr]       = (uint32_t)L1C_DCache_Clean_Invalid_By_Addr,
    [ROM_API_INDEX_L1C_DCache_Disable]                     = (uint32_t)L1C_DCache_Disable,
    [ROM_API_INDEX_L1C_DCache_Enable]                      = (uint32_t)L1C_DCache_Enable,
    [ROM_API_INDEX_L1C_DCache_Invalid_All]                 = (uint32_t)L1C_DCache_Invalid_All,
    [ROM_API_INDEX_L1C_DCache_Invalid_By_Addr]             = (uint32_t)L1C_DCache_Invalid_By_Addr,
    [ROM_API_INDEX_L1C_ICache_Disable]                     = (uint32_t)L1C_ICache_Disable,
    [ROM_API_INDEX_L1C_ICache_Enable]                      = (uint32_t)L1C_ICache_Enable,
    [ROM_API_INDEX_L1C_ICache_Invalid_All]                 = (uint32_t)L1C_ICache_Invalid_All,
    [ROM_API_INDEX_L1C_ICache_Invalid_By_Addr]             = (uint32_t)L1C_ICache_Invalid_By_Addr,
    [ROM_API_INDEX_L1C_Set_Cache_Setting_By_ID]            = (uint32_t)L1C_Set_Cache_Setting_By_ID,
    [ROM_API_INDEX_L1C_Set_Wrap]                           = (uint32_t)L1C_Set_Wrap,
    [ROM_API_INDEX_L1C_Get_None_Cache_Addr]                = (uint32_t)L1C_Get_None_Cache_Addr,
    [ROM_API_INDEX_L1C_Is_DCache_Range]                    = (uint32_t)L1C_Is_DCache_Range,
    [ROM_API_INDEX_L1C_DCache_Write_Set]                   = (uint32_t)L1C_DCache_Write_Set,

